app/controllers/api/posts_controller.rb

    def index
      respond_with(Post.all.order('id DESC'))
---
SELECT `posts`.* FROM `posts`   ORDER BY id DESC

    def create
      @post = Post.new(post_params)

      respond_to do |format|
        status = @post.save ? 200 : 422
---
INSERT INTO `posts` (`body`, `created_at`, `title`, `updated_at`) VALUES ('dsuhfsdmuhf', '2014-06-08 13:59:05', 'Test', '2014-06-08 13:59:05')

    def update
      @post = Post.find(params[:id])

      respond_to do |format|
        status = @post.update(post_params) ? 200 : 422
---
SELECT  `posts`.* FROM `posts`  WHERE `posts`.`id` = 0 LIMIT 1
UPDATE `posts` SET `body` = 'Опубликован рейтинг лучших европейских пляжей 2014 года. Топ-лист из 15 пунктов был составлен на основе исследования бельгийского бюро European Best Destinations, занимающегося увеличением турпотока в Евросоюз, составило рейтинг лучших пляжей Европы, сообщает The Daily Mail.\n\nСпециалисты подготовили свой рейтинг в сотрудничестве с независимой организацией European Consumers Choice, занимающейся анализом предпочтений жителей Евросоюза. Пляжи-номинанты выбирались в соответствии с данными организации Евростат за 2013 год и рекомендациями экспертов индустрии путешествий. Финалисты были выбраны путем онлайн-голосования, проведенного среди европейцев.', `title` = 'Первый пост', `updated_at` = '2014-06-09 09:23:01' WHERE `posts`.`id` = 1